import pandas as pd

from src.reports import spending_by_category


def test_spending_by_category():
    data = [
        {
            "Дата операции": "03.01.2018 15:55:21",
            "Дата платежа": "03.01.2018",
            "Номер карты": "*7123",
            "Статус": "OK",
            "Сумма операции": -105.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -105.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2,
            "Категория": "Здоровье",
            "MCC": 0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0.3,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7189",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.2,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 316.0
        },
        {
            "Дата операции": "01.01.2020 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 5,
            "Категория": "Переводы",
            "MCC": 2.3,
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0
        }
    ]
    result_2 = [
        {
            "Дата операции": "03.01.2018 15:55:21",
            "Дата платежа": "03.01.2018",
            "Номер карты": "*7123",
            "Статус": "OK",
            "Сумма операции": -105.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -105.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2,
            "Категория": "Здоровье",
            "MCC": 0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        }
    ]
    df_result_2 = pd.DataFrame(result_2)
    df_result_2["Дата операции"] = pd.to_datetime(df_result_2["Дата операции"], format='%d.%m.%Y %H:%M:%S')
    final_df_result_2 = df_result_2.to_dict()
    result = spending_by_category(pd.DataFrame(data), "Здоровье", '2018-02-15').reset_index(drop=True).to_dict()
    assert result == final_df_result_2
